Tekla Open API Reference for Tekla Structures 2025
DistanceList.IndexOf Method
 Returns the index of the first matching item in the list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IndexOf(
	Distance item
)
Public Function IndexOf (
	item As Distance
) As Integer
Parameters
item
Type: Tekla.Structures.Datatype.Distance
The item to be matched.
Return Value
Type: Int32
The index of the first matching item.
Implements
IList<T>.IndexOf(T)
Examples
 This example shows how to determine the index of the first matching Distance instance in a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // We'll use this distance list to demonstrate the IndexOf method.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           int index = distanceList.IndexOf(new Distance(2));
           if(index < 0)
           {
               // Not found.
           }
           else
           {
               // Found, do something with the index.
           }
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace